{"id":4173494248,"nameId":"ch-2-xpr-50-its-all-about-the-game-ft-lenval-brown","title":"Ch 2: XPR-50 (It's All About the Game) [ft. Lenval Brown]","url":"/track/ch-2-xpr-50-its-all-about-the-game-ft-lenval-brown","download":"https://t4.bcbits.com/stream/9341568a9ba6901e1a92d7fb121898fb/mp3-128/4173494248?p=0&ts=1760682899&t=0b8a8380938295f8ee1294786eecb6ad71c9103f&token=1760682899_b27f12eb6a83ee451d473663cd77e2544e01de6f","album":"Love & Ponystep","albumURL":"https://vyletpony.bandcamp.com/album/love-ponystep","lyrics":["The sharp pangs of overindulgence splinter your very being, Vid. Even when you’re ‘in the moment’, there is no endearment or joy in your excursions. You crave for a sincere, candid love, which is not reciprocated against this flurried heart. We both know this. We overflow with this love, with nowhere to put it, and now it is not dissimilar from when ‘Dub’ was still—","Oh fuck. Oh god, I look like shit right now, dude","Yeah. Man. Totally shit. But I wasn’t going to say it. That one, you didn’t need me for.","Do I like ‘need’ you? For anything? 'Cuz like right now, you're being a killjoy.","You do. And, to be honest, there is very little joy to kill at all, right now. ","We got Sherlock in here","Self preservation is always necessary. You feel like shit. Naturally, you don’t want to feel like shit. It’s an equation.","Yep. But like, I don't, I don’t like really do equations, though, dude, like","Vid. Gwenyth.","Oh my god, oh, oh","All of this. ALL of this. Is the game. It’s all about the game. The game is all about the players. To play, you have to remember yourself. And you can start by wiping yourself off. ","Oh here we go, ahah!","Take a shower. ","This is rich! Okay","Get sober. And—","And, what, stop letting that Lulamoon bitch hit? Ahaha","It is a confusing time for us. We both know the projection doesn’t make it any less confusing. In order to—","Okay, you know what? Tough shit man. We’ve got a date, a prom even. So, peace.","Very few rounds remain in the magazine of the proverbial sniper rifle. Precision jackets of lead alloys sparkle in their nest, awaiting their targets. But a sniper with no targets, *and* a sniper with no rounds left, can make no trickshots. And when it’s all about the game, switching to your sidearm isn’t actually faster. Truly, a woman must polish her weapon to see her reflection first. Then. Try again."],"acronyms":["c2xflb","c2xflb"],"coverArtAttribution":"StereoFlier"}