{"id":1984895756,"nameId":"ch-3-ballista-dear-aria-i-love-myself-ft-lenval-brown","title":"Ch 3: Ballista (Dear Aria, I Love Myself) [ft. Lenval Brown]","url":"/track/ch-3-ballista-dear-aria-i-love-myself-ft-lenval-brown","download":"https://t4.bcbits.com/stream/7f65f70419a1715eb05ddff0b9737383/mp3-128/1984895756?p=0&ts=1760682899&t=1b848e4a8fa27cdbd45659398bf2a6c3e14d7497&token=1760682899_114af7a8d333d6b4275f19f5be47c732040bce5f","album":"Love & Ponystep","albumURL":"https://vyletpony.bandcamp.com/album/love-ponystep","lyrics":["Warm tears disappear at once into disheveled shrouds of faded eyeshadow, then slither down your cheeks, and into your mouth. Fragrances of bitter salt permeate your laboured breaths. You sense, distantly, the gentle embrace of your pegasus companion.","What do I do man? What do I do? I’ve been trying so hard to just get over Dub. What am I missing? I don't understand why this is so hard","Love is a pain. An endeavour. Temporary. But love is necessary and inevitable. The self is permutated by it, thus it is necessary to wield it shrewdly.","I just want to love, I don’t know what this feeling is, like, my heart aches. What do I do with it? I'm such a bitch.","Understand this, and this above all other things. Before you can truly love anyone else. Before you can fall in love with the world itself. You must love yourself first.","How the fuck do I love myself if I’m so awful?","Your conscious experience is filtered through your brain, and your brain alone. To dare and ask these questions to yourself indicates a primal desire to be better, and to heal. Submerged beneath cynicism and irony, your heart lusts for the ordinary and the sensory. The prickle of the grass beneath your hooves. A distant chatter on a safe day. Stifling a giggle with a friend, in delight of the absurd. The thrill of the trickshot. The thrill of the game. Everything that you experience is because you have chosen to get up again in service to that will. When you are all that you have, endeavour to be something that you love. Then, love yourself. Nothing else matters. There is absolutely no other way to live. And you must live.","'Cuz it ends up hurting everyone around me when I'm so mean to myself, and I don't need to be. And it's like, I live in my own world. So I have to love myself because—","Nothing truly matters until you decide that it does. And baby, does it feel good to love yourself. You must only allow yourself that freedom.","Because my own mind creates the world. It’s all about the game, because I make the rules.","Yes. And it has always been this way.","And to love myself, I don't have to win. I don't have to be perfect, I just have to keep going. I have to make new rules. And I must keep changing."],"acronyms":["c3bflb","c3bflb"],"coverArtAttribution":"Larvaecandy"}