{"id":1461699619,"nameId":"hush","title":"Hush!","url":"/track/hush","download":"https://t4.bcbits.com/stream/37fa8671984b0a1840d906535c903e39/mp3-128/1461699619?p=0&ts=1760683044&t=a6ff6cc33f4fcef6db00b43acf5dc15ba6ddbdca&token=1760683044_1c3c4277a6b9f455195161bac5c6be29cd048b88","album":"Carousel (An Examination of the Shadow, Creekflow, and its Life as an Afterthought)","albumURL":"https://vyletpony.bandcamp.com/album/carousel-an-examination-of-the-shadow-creekflow-and-its-life-as-an-afterthought","lyrics":["An abandoned lilac’s pedals dissolve, endeavouring murky fibers torn by a churning ocean","Saints will turn to sinners, and sinners to apologists once the cash has dried","Hush now and forever disturb the peaces of your life","Sew together, sow through any weather, and reap on a harvest moon so red that both your hooves are clean again","A cacophony disembodied, disavowed, and vacant dies in your abstinence, whispers at your doorstep that forgot the shouts of the paper boy, extra","Feel free to smile, aren’t you tired, you’ve already a mouth full of worms","Hush now! Engendered your rest in a wildfire in your hometown","Would every battle still and every petal set, life’s colours dull into a coma, and nobody weeps","There’s a stagnant nescience served on every street corner, but to the humbled with one request met by a sentence to the plea","Photograph the hoofprints by the ashes, redefine and reconcile the pain through painting","The whore’s found a new position, the old angler reels a new technique, a bravest strike to the easel covers red the walls of a finely furnished home, teaching a new dog new tricks","Count to four, it’s been done before, say it with your own voice","What are you afraid of?","Comfort’s commanded a sinister sleaze, a spell broken by breaking the rules","Hush now, until you’ve something to say","Hush now, you feign benignly — indulge stagnation; a sickly, cyclical, sinister, abomination","Carve in blood an oath to no promise, no compromise, no push, no pull, no ebb, no flow, to enjoy solace in the stillness of the stale air","Are you fucking happy?","Why are you fucking smiling?","Is this all you’ve ever wanted?","It’s me, it’s me","Your shadow","Would they miss you dearly, as I grow in your spotlight","Would your visage outshine the penumbra cast in your glorious moments, how your standing ovation stands no notion or notice in the slowing of motion to motive","Are you the sum of all which the light graces, or will you be valued by the outlines you leave","This creek that swayed as always in all ways, now halts at your dismal presence; the life at its outer edges die in a plastic hush","No babble to Babel, one ill fate can topple the most still of all things","Hush now, and let the flowers wilt wistfully beneath your step","Treacherous","Harvest moon’s coming down tonight","Reap what you sow motherfucker","Woke up this morning","To the blood on the mirror","Your face was priceless","Like bloody murder","Screaming out your soul","Set free this tender ego","This waiting game’s a lie","Place your bets, scrape the rest","Racing through the pig’s sty","You know it all","Back to the front","Everything I know","Sing a song about life","Motherfucker"],"acronyms":[],"coverArtAttribution":"StereoFlier"}